[[https://adventofcode.com/2018/][2018 Advent of Code]]

** Solutions
#+BEGIN_SRC bash
./p1.escript
#+END_SRC

#+RESULTS:
| p1_1: |   459 |
| p2_2: | 65474 |
** Solutions
#+BEGIN_SRC bash
./p2.escript
#+END_SRC

#+RESULTS:
| p2_1: |                      7657 |
| p2_2: | ivjhcadokeltwgsfsmqwrbnuy |
** Solutions
#+BEGIN_SRC bash
./p3.escript
#+END_SRC

#+RESULTS:
| p3_1: | 105047 |
| p3_2: |    658 |
** Solution
#+BEGIN_SRC bash
./p4.escript
#+END_SRC

#+RESULTS:
: p4_1: 76357
